##### blue pasta sliv by babytrep ######
import os
os.system("cls && color c")
print(" [!] Enter the key.\n [?] If u dont know key - write GET KEY")
key = input(" [.] Key <.> ")
if key == "GET KEY":
  print(" [!] Click > https://bit.ly/3AhnQ2E")
if key == "56f3db44e25e3057caa2b78751fa212c":
 print(" [/] Key is correct! Good using..")
 os.system("cls")
 import discord
 from discord.ext import commands
 import random
 import asyncio
 import sys
 import time
 def blueprint(text, delay):
   for c in text:
       sys.stdout.write(c)
       sys.stdout.flush()
       time.sleep(delay)
   print()
 os.system("color b")
 print(f" [!] Enter the token of bot.\n [?] How to get token? Check discord.dev!")
 token = input(" <.> ")
 channelsetted = 1006894997913739304
 guildsetted = 1004762433920966737
 userid = "No"
 toggle = "Off"
 ctypes = ["voice", "text"]
 texttoprint = f"""
               ÔûêÔûêÔûêÔûêÔûêÔûêÔòù ÔûêÔûêÔòù     ÔûêÔûêÔòù   ÔûêÔûêÔòùÔûêÔûêÔûêÔûêÔûêÔûêÔûêÔòù ÔûêÔûêÔûêÔûêÔûêÔûêÔòùÔûêÔûêÔûêÔûêÔûêÔûêÔòù ÔûêÔûêÔòù   ÔûêÔûêÔòùÔûêÔûêÔûêÔûêÔûêÔûêÔûêÔòùÔûêÔûêÔòù  ÔûêÔûêÔòùÔûêÔûêÔûêÔûêÔûêÔûêÔûêÔòùÔûêÔûêÔûêÔûêÔûêÔûêÔòù 
               ÔûêÔûêÔòöÔòÉÔòÉÔûêÔûêÔòùÔûêÔûêÔòæ     ÔûêÔûêÔòæ   ÔûêÔûêÔòæÔûêÔûêÔòöÔòÉÔòÉÔòÉÔòÉÔòØÔûêÔûêÔòöÔòÉÔòÉÔòÉÔòÉÔòØÔûêÔûêÔòöÔòÉÔòÉÔûêÔûêÔòùÔûêÔûêÔòæ   ÔûêÔûêÔòæÔûêÔûêÔòöÔòÉÔòÉÔòÉÔòÉÔòØÔûêÔûêÔòæ  ÔûêÔûêÔòæÔûêÔûêÔòöÔòÉÔòÉÔòÉÔòÉÔòØÔûêÔûêÔòöÔòÉÔòÉÔûêÔûêÔòù
               ÔûêÔûêÔûêÔûêÔûêÔûêÔòöÔòØÔûêÔûêÔòæ     ÔûêÔûêÔòæ   ÔûêÔûêÔòæÔûêÔûêÔûêÔûêÔûêÔòù  ÔûêÔûêÔòæ     ÔûêÔûêÔûêÔûêÔûêÔûêÔòöÔòØÔûêÔûêÔòæ   ÔûêÔûêÔòæÔûêÔûêÔûêÔûêÔûêÔûêÔûêÔòùÔûêÔûêÔûêÔûêÔûêÔûêÔûêÔòæÔûêÔûêÔûêÔûêÔûêÔòù  ÔûêÔûêÔûêÔûêÔûêÔûêÔòöÔòØ
               ÔûêÔûêÔòöÔòÉÔòÉÔûêÔûêÔòùÔûêÔûêÔòæ     ÔûêÔûêÔòæ   ÔûêÔûêÔòæÔûêÔûêÔòöÔòÉÔòÉÔòØ  ÔûêÔûêÔòæ     ÔûêÔûêÔòöÔòÉÔòÉÔûêÔûêÔòùÔûêÔûêÔòæ   ÔûêÔûêÔòæÔòÜÔòÉÔòÉÔòÉÔòÉÔûêÔûêÔòæÔûêÔûêÔòöÔòÉÔòÉÔûêÔûêÔòæÔûêÔûêÔòöÔòÉÔòÉÔòØ  ÔûêÔûêÔòöÔòÉÔòÉÔûêÔûêÔòù
               ÔûêÔûêÔûêÔûêÔûêÔûêÔòöÔòØÔûêÔûêÔûêÔûêÔûêÔûêÔûêÔòùÔòÜÔûêÔûêÔûêÔûêÔûêÔûêÔòöÔòØÔûêÔûêÔûêÔûêÔûêÔûêÔûêÔòùÔòÜÔûêÔûêÔûêÔûêÔûêÔûêÔòùÔûêÔûêÔòæ  ÔûêÔûêÔòæÔòÜÔûêÔûêÔûêÔûêÔûêÔûêÔòöÔòØÔûêÔûêÔûêÔûêÔûêÔûêÔûêÔòæÔûêÔûêÔòæ  ÔûêÔûêÔòæÔûêÔ╔╝/╔╝/╔╝/╔╝/╔╝/╔╝/╚╦/╔╝/╔╝/╚─mT╔╝╔╝╚─=T¾mT¾mT¾mT¾mT¾mß┬gß┬Cß┬Cß┬Cß┬Cß┬Cß┬jT╚╬╚─╚─╚─╚─╚─╚─╚hT/╚Ã»╚─/╚─/╚─/╚─/╚─/╚═-ß┬gß┬Cß┬Cß┬Cß┬Cß┬Cß┬Cß┬jT╚╬╚─╚─╚─╚─╚─╚jÁ╚╬╚─╚hSmß┬gß┬Cß┬jT╚╬╚─╚─╚─╚─╚─╚hT/╚Ã»╚─/╚─/╚─/╚─/╚─/╚─/╚═´╚Ã»╚─/╚═-T╚╬╚─╚jÁ╚╬╚─╚─╚─╚─╚─╚─╚jÁ╚╬╚─╚hSmß┬gß┬Cß┬j@6ÝT¾mT¾mT¾mT¾mT¾mT¾mT¾mT¾mT¾mT¾mT¾mT¾mT¾mT¾mU#ƒ0öª0XÝºb0É4UA0S«/qún.@6└>¾mT¾mT¾mT¾mT¾mß╝¯
Á═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╔
´¥t@>¾mT¾mT¾mT¾mT¾mT¾mT¾mT¾mU ÝT¾mT¾mT¾mT¾mT¾mT¾mT¾åü~TSmT¾mT¾mT¾mT¾mT¾mT¾mUÇ@6ÝT¾mT¾mT¾mT¾mT¾mT¾d\Sèº<┤0Sªúmr®;£ú:mT¾mT¾mT¾m\mqT¾mT¾mT¾mT¾mT¾mT¾mT¾mdd\UuƒaÝºb%½2%@6ÝT¾mT¾mT¾mT¾mT¾mT¾e\Så0áÝºq.®B&T¾mT¾mT¾mT¾mT¾m³mb4U0,×a0ÿÝ£ÉÝT¾mT¾mT¾m@6ÝT¾mT¾mT¾mT¾mT¾mT¾f\SÉº2.®1Ý/k«ú>rá¾mT¾mT¾mT¾m\mb4UA0ØrT¾mT¾mT¾mT¾mT¾m@6ÝT¾mT¾mT¾mT¾mT¾mT¾t\Sæ0Ö2®1Ý/k«ú>rá¾mT¾mT¾mT¾mdc\U 2¿¾«1=\ó²\0¾mT¾mT¾mT¾m@6ÝT¾mT¾mT¾mT¾mT¾mT¾u\SÅ,×-¿á2ª¾mT¾mT¾mT¾mT¾mT¾mT¾mT¾mT¾mT¾mT¾mT¾mT¾mT¾mT¾m@6ÝT¾mT¾mT¾mT¾mT¾mT¾v\SÖ0öÂ0S┤Ø1Ý3rí0ÝT¾mT¾mT¾mT¾mT¾mT¾mT¾mT¾mT¾mT¾mT¾mT¾m@6ÝT¾mT¾mT¾mT¾mT¾mT¾mT¾mT¾mT¾mT¾mT¾mT¾mT¾@>¾mT¾mT¾mT¾mT¾mß╝¯
Á═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╚═╔
´¥t@>¾mT¾mT¾mT¾mT¾mT¾mT¾mT¾mT¾mT¾mT¾mT¾mT¾mT¾mT¾mT¾mT¾mT¾mT¾mT¾mT¾mT¾mT¾mT¾mT¾mT¾mT¾mT¾mT¾mT¾mT¦V§o@6ÝÑE£íá█W",æú:ab■/\=U0£Æ!¿¾}U0"áØnú1&có¿¹░úm`,×q+sÑ0ô¼¾}T§nV°ÝØ2Ñ/púm`,×q~bú1▀U<í®2!®FmS▒£á0úu▒cí®2!®Fa,Ö\³\@6└>¾ì/i0×tc260×t@6Ý,á9ú6m123U?a+u▓,æ9\³z@6ÝT¾múvaº|ª®2 \§░íFmZ‗Ý/o_úumU\@6ÝT¾m®;▓áÆ&U
-']�>¾mT¾░Ø4íú2ºb4®21U
-dccyyldfjffc�¦T¾mU:Á£Ö1U
-WbV¦T¾mUB&0Ñ£0¾}T§üóU@>¾mT¾┤újÜí1ÝSoc3V¦T¾mU5ƒ¿Æ#º<í¿¹┤0½┤®?cº<í¿°Ýd■#eu\=T¾mUJø£Ö2U!%¿æ·@6ÝT¾mU0úl░0S}U<íÑB4\§mkó£É2Uß
¾o\=T¾mT¾£2¾░Ø?\/aÝm-Wo¦T¾mT¾mU0,×a0Ö0¾}U<íÑB4\§mEnter channeld id <.>")
       text = input(" Enter text to send <.> ")
       channel = client.get_channel(channelid)
       await channel.send(str(text))
       await asyncio.sleep(3)
     if choice == "2":
      status = input(" Enter the status type <.> ")
      statuses = ["playing", "listening", "watching"]
      print(" Status types: playing, listening, watching")
      if status in statuses == False:
        print(" Enter the valid type!")
      else:
        if status == "playing":
          status = input(" Enter the text <.> ")
          game = discord.Game(str(status))
          await client.change_presence(activity=discord.Activity(type=discord.ActivityType.playing, name=status))
          print(" Changed!")
        if status == "watching":
          status = input(" Enter the text <.> ")
          game = discord.Game(str(status))
          await client.change_presence(activity=discord.Activity(type=discord.ActivityType.watching, name=status))
          print(" Changed!")
        if status == "listening":
          status = input(" Enter the text <.> ")
          game = discord.Game(str(status))
          await client.change_presence(activity=discord.Activity(type=discord.ActivityType.listening, name=status))
          print(" Changed!")
     if choice == "3":
        if guildsetted == "No":
          print(" Enter the valid guild id!")
          os.system("cls && color 9")
          await asyncio.sleep(2)
          print(texttoprint)
        else:
          name = input(" Channel name <.> ")
          ctype = input(" Channel type (voice or text) <.> ")
          guild = client.get_guild(guildsetted)
          if ctype == "voice":
           try:
            await guild.create_voice_channel(name=name)
            os.system("cls && color 9")
            print(texttoprint)
           except:
            print(" [!] Missing Permissions to create channel!")
          else:
           await guild.create_text_channel(name=name)
           os.system("cls && color 9")
           print(texttoprint)
     if choice == "4W└>¾mT¾mUA%¼f└>¾mT¾mT¾mT¾░Ø4íú23?e12U
-£×c¿á█V¾Æíí2ª¾û¾|c-V³@>¾mT¾mT¾mT¾░Ø4íú2U
-/i0×tc:▓®/pØ4íú2]<í¿¹░Ø4íú23?e12\\@>¾mT¾mT¾mT¾«½d£¿¾░Ø4íú2c12í240[\@6ÝT¾mT¾▓¡02Ñ@·@6ÝT¾mT¾mT¾mÑE£íá█V¾¿Tì-£ªºlí2Sâ0Ñá£á&£ƒaªS┤óS▒0Ö2®1Ý/k«ú>rá¶o\=T¾mT¾£2¾░Ø?\/aÝm-W´¦T¾mT¾m®E╣¦T¾mT¾mT¾Áºb%3?e/4íU
-£×c¿á█V¾Æíí2ª¾êºb%UæUß
¾o\=T¾mT¾mT¾Áºb%U
-/i0×tc:▓®/uºb%]<í¿¹Áºb%3?e/4í\\@>¾mT¾mT¾m¿á2ª■o,×º2.ºoaUêºaÝ950p%¿á0Ñm░¾Ü£í¿òa/o`ch!½sóÑí.í1Ô/950É%¿á0Ño\=T¾mT¾mT¾úº<í¿¹oU"&0Ñm/4íú21TU\@6ÝT¾mT¾▓¡02Ñ@·@6ÝT¾mT¾mUCÑ£×t\§m&T¬U\ºpú:mÑ2%á£ªºlóíªm®?-/4íUA£ªm¿á2ª¶o\=T¾mT¾£2¾░Ø?\/aÝm-W´¦T¾mT¾m3rí0ÝS░í<▓íáß3b4+jÁ£Ö1]<í¿¹Ü¿£ƒ1@2®A20³\@6ÝT¾mU<│U0úl░0S}SoUz@6ÝT¾mT¾úº<í¿¹oU' (SÅ,ò╣!E▓ñ¶ÂñÏÐì-ð╝|¹Ðä~ÏV³@>¾mT¾m£ÆÝ/kó£É2U
=T§xW└>¾mT¾mU0,×a0Ö&0í40ÉÝS£íúÁ¿¹o×t0Ñm®;▓U,×a0ÿÝpÝ■>T§\@6ÝT¾mU<│U0úl░0S}SoUz@6ÝT¾mT¾úº<í¿¹oU'¯(SÄ/q½1Ý®;▓áÆ&¾®ó§m^S┤Ø2 0ª\@6ÝT¾mT¾┤Ø2 0S}U<íÑB4\§m×t0Ñm®;▓U0úlª0S|c/\=T¾mT¾m£ÆÝ®;▓áæÝ£×-®;▓áÆ&U
=U.í@2¦T¾mT¾mT¾úº<í¿¹oU!®2%UA0SÂ,Ö0¾┤Ø2 0S£0§\@6ÝT¾mU<│U0úl░0S}Sodco¦T¾mT¾mÑE£íá█V¾¿]-æ £× pÝ`SÁºb%UJøóSÀ£ÖU5▓U:£½2!U4▒á£íUC▓º=fV³@>¾mT¾mU4▒á£í£ÉÝS£íúÁ¿¹oU!®2%UA0Sêºb%pÝ■>T§\@6ÝT¾mT¾úº<í¿¹oU'¯(Så¿É00á&1óá¶o\=T¾mT¾£2¾░Ø?\/aÝm-WdW└>¾mT¾mUCÑ£×t\§m&ojU!Ý/díUB&0Um^So(¾íV¾^T§m3?eU>r¬Sª®E£ú:nT¹À£íU75ºpÝ(¾\V³@>¾mT¾mU0%,á+q2¡@ÝS£íúÁ¿¹oU!®2%UA0SªÑ4áUA2¡@Ý■>T§\@6ÝT¾mT¾Ü¿£ƒ1@2®A20¾}U<íÑB4\§m×t0Ñmrí0ÝpÝ■>T§\@6ÝT¾mT¾Ü¿£ƒ0¾}U0£Æ!¿■Z0í,3rí0█£×t]:Á£Ö1ºb4®21\\@>¾mT¾mUCÑ£×t\§m&ojU 2Ñú2ª¾í¿ÿú:mºq.Ñí20■!b§\@6ÝT¾mT¾«½d£¿¾Ü¿£ƒ0■r1<┤]>náæÝSoUÄKÆ¾Å$SÅ""BTU\@6ÝT¾mT¾│úum£S£ó¾Ñ,×Z0[de\¦T¾mT¾mT¾«½d£¿¾Ü¿£ƒ0■pº2.®2,®28®/pØ4íú2]>náæ²W0%,á0ÉÓ/950É%¿á0Ño\=T¾mT¾mT¾«½d£¿¾Ü¿£ƒ0■pº2.®2,®28®/pØ4íú2]>náæ²W0%,á0ÉÓ/950É%¿á0Ño\=T¾mT¾mT¾│úum/k«ú>rá¾£ó¾Ü¿£ƒ0■pØ4íú2ªf└>¾mT¾mT¾mT¾mT¾┤Ñ¼z@6ÝT¾mT¾mT¾mT¾mU4À,£┤U0,×a0ÿßºb!0¹ª®E[/u«ºk¼®28¿³\@6ÝT¾mT¾mT¾mT¾m0½░0ú┤¦T¾mT¾mT¾mT¾mT¾mT¾░únt£×u0=T¾mT¾mT¾│úum/k«ú>rá¾£ó¾Ü¿£ƒ0■pØ4íú2ªf└>¾mT¾mT¾mT¾£2¾░Ø4íú2c>náæÝTm-W0%,á0ÉÓ/950É%¿á0Ño¦T¾mT¾mT¾mT¾m,¬«£áÝ/k«ú>rá■q0Ö2®1└>¦@6Ý®E╣¦T¾░í<▓íáßÑó!]A"ƒb!\=U28/b#®└>¾mT¾múvaº|ª®2 \§░íFmZ‗Ý/o_úum.U\@6ÝT¾mUCÑ£×t\§ÅúpÝ®?^0×-£ªm£×v,Ö0¾z\§\@6ÝT¾mU<íÑB4\³